"Please Donate" = "Por favor, haz una donación";

"Donate!" = "¡Donar!";
"This is free software, but it still costs money to write, support, and distribute it. If you enjoy using it, please consider a donation to the authors of this software. It will help to make Cyberduck even better!" = "Ha costado varias noches crear esta aplicación. Si disfrutas usándola, por favor plantéate el hacer una donación al autor de este software. ¡Eso ayudará a hacer que Cyberduck sea todavía mejor!";
"As a contributor to Cyberduck, you receive a registration key that disables this prompt." = "Como contribuyente de Cyberduck, recibes una clave de donación que desactiva este aviso.";

"Thank you for using Cyberduck!" = "¡Gracias por usar Cyberduck!";

"Later" = "Más tarde";

"Don't show again for this version." = "No volver a mostrar este mensaje.";

"The payment can be made simply and safely using Paypal. You don't need to open an account." = "El pago se puede hacer de forma sencilla y segura usando Paypal. No necesitas abrir una cuenta.";

"Donation Key" = "Clave de donación";

